# StructuralSectionColdFormed Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionColdFormed Class
Members See Also
---
Defines parameters for Hot Formed structural section.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class StructuralSectionColdFormed : StructuralSectionRectangular
```

Visual Basic
---
```text
Public Class StructuralSectionColdFormed _
	Inherits StructuralSectionRectangular
```

Visual C++
---
```text
public ref class StructuralSectionColdFormed : public StructuralSectionRectangular
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionColdFormed Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralC Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralCEx Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralLA Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralLZ Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionSigmaProfile Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionSigmaProfileWithFold Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionSigmaProfileWithLips
# See Also
StructuralSectionColdFormed Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace